# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2
  - [-1, 3, C2f, [32]]
  - [-1, 1, Conv, [96, 3, 2]]  # 2-P2/4
  - [-1, 4, C2f, [96, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 3, C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 3, C2f, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2f, [1024]]

# YOLOv8.0-p2 head
head:
  - [5, 1, bilinear, [96, 2]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 4, C2f, [96, True]]  # 12

  - [-1, 1, bilinear, [32, 2]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 3, C2f, [32]]  # 15

  - [7, 1, bilinear, [256, 2]]
  - [12, 1, Conv, [256, 3, 2]]
  - [ [ -1, -2, 5 ], 1, Concat, [ 1 ] ]
  - [-1, 3, C2f, [256]]  # 19

  - [ 19, 1, bilinear, [ 128, 2 ] ]
  - [15, 1, Conv, [128, 3, 2]]
  - [ [ -1, -2, 2 ], 1, Concat, [ 1 ] ]
  - [ -1, 4, C2f, [ 128, True ] ]  # 23

  - [9, 1, bilinear, [512, 2]]
  - [19, 1, Conv, [512, 3, 2]]
  - [ [ -1, -2, 7 ], 1, Concat, [ 1 ] ]
  - [-1, 3, C2f, [512]]  # 27

  - [27, 1, bilinear, [256, 2]]
  - [23, 1, Conv, [256, 3, 2]]
  - [[-1, -2, 19], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 31

  - [31, 1, bilinear, [128, 2]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 4, C2f, [128, True]]  # 34

  - [34, 1, bilinear, [32, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [32]]  # 37

  - [27, 1, Conv, [1024, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]  # 40

  - [40, 1, bilinear, [512, 2]]
  - [31, 1, Conv, [512, 3, 2]]
  - [ [ -1, -2, 27 ], 1, Concat, [ 1 ] ]
  - [-1, 3, C2f, [512]]  # 44

  - [44, 1, bilinear, [256, 2]]
  - [34, 1, Conv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 48

  - [48, 1, bilinear, [128, 2]]
  - [37, 1, Conv, [128, 3, 2]]
  - [[-1, -2, 34], 1, Concat, [1]]
  - [-1, 4, C2f, [128, True]]  # 52

  - [[52], 1, Detect, [nc]]  # Detect(P2)
