


# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 2]]        # 0
  - [ -1, 1, CLfS3, [ 32 ] ]   # 1  P1
  - [-1, 1, Conv, [96, 3, 2]]
  - [ -1, 1, CLfS4, [ 96, True ] ]   # 3  P2

# YOLOv5 v6.0 head
head:
  [[ -1, 1, CLfS4, [ 96, True ] ],       # 8   P2

   [-1, 1, bilinear, [32, 2]],
   [ [ -1, 1 ], 1, Concat, [ 1 ] ],
   [ -1, 1, CLfS3, [ 32 ] ],       # 11   P1

   [ -1, 1, Conv, [96, 2, 2, 0 ] ],
   [ [ -1, 4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, CLfS4, [ 128, True ] ],      # 14   P2

   [ -1, 1, CLfS4, [ 128, True ] ],       # 20   P2

   [ -1, 1, bilinear, [ 32, 2 ] ],
   [ [ -1, 7 ], 1, Concat, [ 1 ] ],
   [ -1, 1, CLfS3, [ 32 ] ],       # 23   P1

   [ -1, 1, Conv, [ 128, 2, 2, 0 ] ],
   [ [ -1, 11 ], 1, Concat, [ 1 ] ],
   [ -1, 1, CLfS4, [ 128, True ] ],      # 26   P2

   [[17], 1, Detect, [nc]]
]